config.org
#+title: Danszek's doom-emacs config

* Table of content :toc:
- [[#font-theme-and-visuals][font, theme and visuals]]
  - [[#animations-cursor-and-scroll-settings-for-a-fresher-ui][animations, cursor and scroll settings for a fresher ui]]
- [[#org-mode-configs][org mode configs]]
  - [[#font-configs][font configs]]
  - [[#settings-for-source-code-blocks][Settings for source code blocks.]]
  - [[#emphasis-markers][emphasis markers]]
  - [[#inline-images][inline images]]
  - [[#links][links]]
  - [[#org-modern-configs][org-modern configs]]
- [[#nixos-specific-config-to-rebuild-and-stuff][NixOS specific config to rebuild and stuff]]
- [[#misc][Misc]]
  - [[#daemons-systemd-unit-management][daemons (systemd unit management)]]

* font, theme and visuals

 Doom exposes five (optional) variables for controlling fonts in Doom:

   - `doom-font' -- the primary font to use
   - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
   - `doom-big-font' -- used for `doom-big-font-mode'; use this for
     presentations or streaming.
   - `doom-symbol-font' -- for symbols
   - `doom-serif-font' -- for the `fixed-pitch-serif' face

 See 'C-h v doom-font' for documentation and more examples of what they
 accept. For example:

(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))

 If you or Emacs can't find your font, use 'M-x describe-font' to look them
 up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
 refresh your font settings. If Emacs still can't find your font, it likely
 wasn't installed correctly. Font issues are rarely Doom issues!

 The font needs to be installed on your system: https://typeof.net/Iosevka/

#+begin_src emacs-lisp
(setq doom-font (font-spec :size 18 :family "Iosevka"))
(setq doom-theme 'doom-outrun-electric)
#+end_src


This determines the style of line numbers in effect.
Possible values are:

| value    | effect                          |
|----------+---------------------------------|
| nil      | don't show any line numbers     |
| t        | (true) show normal line numbers |
| relative | show relative line numbers      |

#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src

** animations, cursor and scroll settings for a fresher ui

emacs built-in version of smooth-scroll:
#+begin_src emacs-lisp
(pixel-scroll-precision-mode 1)
#+end_src

pulse effects for various actions:
#+begin_src emacs-lisp
(setq pulse-delay 0.05)
(setq pulse-iterations 15)
#+end_src

transparency/blur
#+begin_src emacs-lisp
(set-frame-parameter nil 'alpha-background 95)
#+end_src

window start position and size
#+begin_src emacs-lisp
(setq default-frame-alist
      '((width . 0.9)
        (height . 0.25)))
#+end_src
* org mode configs

#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

** font configs

This will customize the org mode headers to be slightly bigger than normal text.
#+begin_src emacs-lisp
(setq org-fontify-whole-heading-line t
    org-fontify-done-headline t
    org-fontify-quote-and-verse-blocks t)

(custom-set-faces!
'(org-level-1 :inherit outline-1 :height 1.2 :weight bold)
'(org-level-2 :inherit outline-2 :height 1.1 :weight bold)
'(org-level-3 :inherit outline-3 :height 1.05 :weight semi-bold)
'(org-level-4 :inherit outline-4 :height 1.01 :weight semi-bold)
'(org-document-title :height 1.4 :weight bold))

#+end_src

** Settings for source code blocks.
#+begin_src emacs-lisp
(custom-set-faces!
'(org-block-begin-line :background "#1c1f24" :extend t)
'(org-block :background "#23272e" :extend t)
'(org-block-end-line :background "#1c1f24" :extend t))
#+end_src

** emphasis markers
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t
    org-pretty-entities t)
#+end_src

** inline images
#+begin_src emacs-lisp
(setq org-startup-with-inline-images t
    org-image-actual-width '(500))
#+end_src

** links
#+begin_src emacs-lisp
(setq org-link-descriptive t)
#+end_src

** org-modern configs
#+begin_src emacs-lisp
(setq org-modern-table-horizontal 1)
(setq org-modern-table-horizontal t)
#+end_src

* NixOS specific config to rebuild and stuff

#+begin_src emacs-lisp
(after! compile
  ;; NixOS Flake Konfiguration
  (defvar my/nixos-flake-path "/home/david/nixos-config"
    "Path to your NixOS flake directory")

  (defvar my/nixos-flake-host "desktop"
    "NixOS flake host configuration name")

  ;; Hauptfunktion für NixOS rebuild - MIT interaktivem sudo!
  (defun my/nixos-rebuild (&optional arg)
    "Rebuild NixOS with flake configuration in vterm (interactive sudo).
With prefix arg (C-u), prompt for different options."
    (interactive "P")
    (let* ((action (if arg
                       (completing-read "Action: "
                                      '("switch" "boot" "test" "build" "dry-build"))
                     "switch"))
           (flake-ref (format "%s#%s" my/nixos-flake-path my/nixos-flake-host))
           (cmd (format "sudo nixos-rebuild %s --flake %s" action flake-ref))
           (default-directory my/nixos-flake-path)
           (buffer-name "*nixos-rebuild*"))
      ;; Nutze vterm für interaktive sudo-Eingabe
      (if (get-buffer buffer-name)
          (switch-to-buffer-other-window buffer-name)
        (let ((vterm-buffer (get-buffer-create buffer-name)))
          (with-current-buffer vterm-buffer
            (vterm-mode)
            (setq-local default-directory my/nixos-flake-path))
          (display-buffer vterm-buffer)))
      (with-current-buffer buffer-name
        (vterm-send-string cmd)
        (vterm-send-return))))

  ;; Schneller test build (ohne sudo, mit compile-mode)
  (defun my/nixos-build ()
    "Build NixOS configuration without switching (no sudo needed)"
    (interactive)
    (let ((flake-ref (format "%s#%s" my/nixos-flake-path my/nixos-flake-host))
          (default-directory my/nixos-flake-path))
      (compile (format "nixos-rebuild build --flake %s" flake-ref))))

  ;; Flake update
  (defun my/nixos-flake-update ()
    "Update flake.lock"
    (interactive)
    (let ((default-directory my/nixos-flake-path))
      (compile "nix flake update")))

  ;; Flake check (schnelle Syntax-Prüfung)
  (defun my/nixos-flake-check ()
    "Check flake for errors"
    (interactive)
    (let ((default-directory my/nixos-flake-path))
      (compile "nix flake check")))

  ;; Auto-detect und setze compile command für NixOS files
  (defun my/set-nixos-compile-command ()
    "Set compile command for NixOS configuration files"
    (when (and buffer-file-name
               (string-match-p (regexp-quote my/nixos-flake-path) buffer-file-name))
      (setq-local compile-command
                  (format "sudo nixos-rebuild switch --flake %s#%s"
                          my/nixos-flake-path
                          my/nixos-flake-host))))

  (add-hook 'nix-mode-hook #'my/set-nixos-compile-command)

  ;; Keybindings - SPC d für "deploy" / NixOS
  (map! :leader
        (:prefix ("d" . "deploy/NixOS")
         :desc "Rebuild switch" "r" #'my/nixos-rebuild
         :desc "Build only" "b" #'my/nixos-build
         :desc "Flake update" "u" #'my/nixos-flake-update
         :desc "Flake check" "c" #'my/nixos-flake-check))

  ;; Spezifische Keybindings in nix-mode
  (map! :map nix-mode-map
        :localleader
        :desc "Rebuild NixOS" "r" #'my/nixos-rebuild
        :desc "Build only" "b" #'my/nixos-build
        :desc "Flake check" "c" #'my/nixos-flake-check
        :desc "Flake update" "u" #'my/nixos-flake-update))
#+end_src

* Misc
** daemons (systemd unit management)
#+begin_src emacs-lisp
(use-package! daemons
  :commands (daemons daemons-status)
  :config
  (setq daemons-always-sudo t))
#+end_src
